In [7]:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

ModuleNotFoundError: No module named 'matplotlib'

In [8]:
df = pd.read_csv("acdemic_data.csv")

In [31]:
df.head(5)

  Firstname Lastname Gender  SPOS  DSBDA     WT  DA
0        LA      Roy      M  85.0   88.0   90.0  92
1        SA    Dixit      F  90.0   90.0   94.0  95
3        DA   Kapoor      M  95.0   86.0  500.0  82
6        DY   Kapoor      M  81.0   80.0   96.0  89
7        JK   Khanna      F  40.0   88.0   95.0  87

In [10]:
missing_value_formats = ["n.a.","?","NA","n/a", "na", "--"]
df = pd.read_csv("acdemic_data.csv", na_values = missing_value_formats)

In [11]:
df['Gender'].head(10)

0    M
1    F
2    M
3    M
4    F
5    F
6    M
7    F
8    M
9    M
Name: Gender, dtype: object

In [12]:
df['Gender'].notnull().head(15)

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
Name: Gender, dtype: bool

In [13]:
null_filter = df['Gender'].notnull()

In [30]:
df[null_filter]

C:\Users\singh\AppData\Local\Temp\ipykernel_14484\3910519782.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[null_filter]

  Firstname Lastname Gender  SPOS  DSBDA     WT  DA
0        LA      Roy      M  85.0   88.0   90.0  92
1        SA    Dixit      F  90.0   90.0   94.0  95
3        DA   Kapoor      M  95.0   86.0  500.0  82
6        DY   Kapoor      M  81.0   80.0   96.0  89
7        JK   Khanna      F  40.0   88.0   95.0  87
8        RT  Pardesi      M  10.0   96.0   94.0  88

In [15]:
df.isnull().sum()

Firstname    0
Lastname     0
Gender       0
SPOS         2
DSBDA        4
WT           1
DA           0
dtype: int64

In [16]:
df.dropna(axis=0,inplace=True)

In [17]:
df['SPOS'].head(10)

0    85.0
1    90.0
3    95.0
6    81.0
7    40.0
8    10.0
Name: SPOS, dtype: float64

In [29]:
df.head(5) 
df.tail(5)

  Firstname Lastname Gender  SPOS  DSBDA     WT  DA
1        SA    Dixit      F  90.0   90.0   94.0  95
3        DA   Kapoor      M  95.0   86.0  500.0  82
6        DY   Kapoor      M  81.0   80.0   96.0  89
7        JK   Khanna      F  40.0   88.0   95.0  87
8        RT  Pardesi      M  10.0   96.0   94.0  88